In [1]:
import pandas as pd
import numpy as np

In [35]:
url = 'https://gist.githubusercontent.com/pravalliyaram/5c05f43d2351249927b8a3f3cc3e5ecf/raw/8bd6144a87988213693754baaa13fb204933282d/Mall_Customers.csv'
data = pd.read_csv(url)

<h3>Описание столбцов:


CustomerID - id пользователя
Genre - пол
Annual Income (k$) - доход в тыс. долларах
Spending Score (1-100) - оценка трат клиентов (1-20: низкий уровень трат.
                                               21-40: средний уровень трат.
                                               41-60: умеренный уровень трат.
                                               61-80: высокий уровень трат.
                                               81-100: очень высокий уровень трат.)

<h3>Типы данных:


CustomerID - целочисленный
Genre - категориальный
Annual Income (k$) - целочисленный
Spending Score (1-100) - целочисленный

<h3>Вывод таблицы

In [36]:
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]


<h3>Вывод первых 5 эелементов

In [37]:
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

<h3>Вывод последних 5 эелементов

In [38]:
data.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

<h3>Использоание функции describe()

In [39]:
data.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

<h3>Считывание значения конкретной ячейки методом iloc

In [40]:
value_1 = data.iloc[3]['Age']
value_1

23

<h3>Считывание значения конкретной ячейки методом at

In [43]:
value_2 = data.at[3, 'Age']
value_2

23

<h3>Считывание значения конкретной ячейки методом loc

In [44]:
value_3 = data.loc[3, 'Age']
value_3

23

<h3>Фильтрация строк по диапазону индекса

In [45]:
value_4 = data.iloc[1:10]
value_4.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76

<h3>Фильтрация набора данных по какому-либо условию

In [46]:
value_5 = data.loc[data['Age'] > 30]
value_5.head()

    CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
4            5  Female   31                  17                      40
6            7  Female   35                  18                       6
8            9    Male   64                  19                       3
10          11    Male   67                  19                      14
11          12  Female   35                  19                      99

<h3>Работа с пропущенными значениями (если они есть): удаление строк с пропущенными значениями, заполнение пропущенных значений средним значением по колонке. Если пропущенных значений нет — намеренно их "генерируете", прибивая какие-то куски данных в np.nan

Создадим пропущенное значение

In [47]:
data.iloc[3, 2] = np.nan
data.iloc[31, 2] = np.nan
data.iloc[8, 2] = np.nan
data.iloc[154, 2] = np.nan
data.iloc[9, 2] = np.nan
data.iloc[83, 2] = np.nan
data = data.fillna(data.mean().round(0))
data.head()

C:\Users\ivan5\AppData\Local\Temp\ipykernel_13264\2277687061.py:7: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data = data.fillna(data.mean().round(0))

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                  15                      39
1           2    Male  21.0                  15                      81
2           3  Female  20.0                  16                       6
3           4  Female  39.0                  16                      77
4           5  Female  31.0                  17                      40

<h3>Cоздание нового поля вычисленного на основе значений других полей: то поле будет показывать, сколько денег клиент зарабатывает на каждый потраченный им рубль. Чем выше значение этого поля, тем лучше финансовое положение клиента.

In [48]:
data['Income_to_Expenses_Ratio'] = data['Annual Income (k$)'] / data['Spending Score (1-100)']
data.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Income_to_Expenses_Ratio
0,1,Male,19.0,15,39,0.384615
1,2,Male,21.0,15,81,0.185185
2,3,Female,20.0,16,6,2.666667
3,4,Female,39.0,16,77,0.207792
4,5,Female,31.0,17,40,0.425000

<h3>Через выражение на базе имеющихся колонок

In [49]:
data['Income_to_Expenses_Ratio'] = data['Annual Income (k$)'] / data['Spending Score (1-100)']
data.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Income_to_Expenses_Ratio
0,1,Male,19.0,15,39,0.384615
1,2,Male,21.0,15,81,0.185185
2,3,Female,20.0,16,6,2.666667
3,4,Female,39.0,16,77,0.207792
4,5,Female,31.0,17,40,0.425000

<h3>Через DataFrame.apply

In [50]:
data['Income_to_Expenses_Ratio'] = data.apply(lambda row: row['Annual Income (k$)'] / row['Spending Score (1-100)'], axis=1)
data.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Income_to_Expenses_Ratio
0,1,Male,19.0,15,39,0.384615
1,2,Male,21.0,15,81,0.185185
2,3,Female,20.0,16,6,2.666667
3,4,Female,39.0,16,77,0.207792
4,5,Female,31.0,17,40,0.425000

<h3>Через Series.apply

In [51]:
data['Income_to_Expenses_Ratio'] = (data['Annual Income (k$)'] / data['Spending Score (1-100)']).apply(lambda x: round(x, 2))
data.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Income_to_Expenses_Ratio
0,1,Male,19.0,15,39,0.38
1,2,Male,21.0,15,81,0.19
2,3,Female,20.0,16,6,2.67
3,4,Female,39.0,16,77,0.21
4,5,Female,31.0,17,40,0.42

<h3>Сортировка по какому-либо из полей

In [52]:
sorted_data = data.sort_values(by='Age')
sorted_data.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Income_to_Expenses_Ratio
114,115,Female,18.0,65,48,1.35
91,92,Male,18.0,59,41,1.44
65,66,Male,18.0,48,59,0.81
33,34,Male,18.0,33,92,0.36
0,1,Male,19.0,15,39,0.38

<h3>Вычислить несколько статистик по колонкам (используйте встроенные агрегатные функции — любые на выбор)

In [53]:
mean_values = data.mean()
mean_values

C:\Users\ivan5\AppData\Local\Temp\ipykernel_13264\3696017384.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mean_values = data.mean()

CustomerID                  100.50000
Age                          38.86500
Annual Income (k$)           60.56000
Spending Score (1-100)       50.20000
Income_to_Expenses_Ratio      2.82425
dtype: float64

In [54]:
median_values = data.median()
median_values

C:\Users\ivan5\AppData\Local\Temp\ipykernel_13264\3440505150.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  median_values = data.median()

CustomerID                  100.500
Age                          36.000
Annual Income (k$)           61.500
Spending Score (1-100)       50.000
Income_to_Expenses_Ratio      1.125
dtype: float64

<h3>value_counts()

In [55]:
genre_counts = data['Gender'].value_counts()
genre_counts

Female    112
Male       88
Name: Gender, dtype: int64

<h3>Вывод уникальных значений колонки через .unique()

In [56]:
unique_genres = data['Gender'].unique()
unique_genres

array(['Male', 'Female'], dtype=object)

<h3>Удалите текущий индекс и создайте новый индекс на базе новой колонки, которая для этого лучше всего подходит

In [57]:
data.reset_index(drop=True, inplace=True)
data.set_index('Gender', inplace=True)
data

,CustomerID,Age,Annual Income (k$),Spending Score (1-100),Income_to_Expenses_Ratio
Gender,,,,,
Male,1,19.0,15,39,0.38
Male,2,21.0,15,81,0.19
Female,3,20.0,16,6,2.67
Female,4,39.0,16,77,0.21
Female,5,31.0,17,40,0.42
...,...,...,...,...,...
Female,196,35.0,120,79,1.52
Female,197,45.0,126,28,4.50
Male,198,32.0,126,74,1.70
Male,199,32.0,137,18,7.61
Male,200,30.0,137,83,1.65